{"meta":{"title":"Hexo","subtitle":null,"description":null,"author":"Mahan Rad","url":"http://truelogician.com"},"pages":[],"posts":[{"title":"Creating a Blog by Hexo","slug":"hexo-quick-start","date":"2016-08-14T19:55:50.000Z","updated":"2016-08-20T18:42:34.000Z","comments":true,"path":"2016/08/hexo-quick-start/","link":"","permalink":"http://truelogician.com/2016/08/hexo-quick-start/","excerpt":"","text":"Have you ever wished you could create your own blog in no time? Did you get frustrated as you thought you might not have enough time to design and set it up? Do you also wish to have more control over your blog comparing to blogs at Wordpress? Well, that was exactly the case for me and if it’s the same for you, then give “static site generators” a go. What is a “Static Stite Generator”?In short, a static site generator is basically a html file generator. It crates and formats html files by using its template engine as well as your text which is usually in a format such as markdown. Static site generators are very much easy to setup and use while providing users with more control over it. You can choose and heavily customize themes, choose among plenty of plugins and finally host your website on github pages for free. What is Hexo?Accoding to Hexo’s documentation, Hexo is a fast, simple and powerful blog framework. You write posts in Markdown (or other languages) and Hexo generates static files with a beautiful theme in seconds. Alright, now let’s dive in. Installing HexoBefore installing hexo, use your OS package manager to update and cleanup system packages. 1$ brew update --all &amp;&amp; brew upgrade --all &amp;&amp; brew cleanup &amp;&amp; brew doctor &amp;&amp; brew prune Install Node.jsHexo is a node.js package. As a result, we first need to install the node.js in case it’s not. 1$ brew install node npm is the default package manager of the node.js. In case you have had the node installed for some time, make an update and clean the previously installed packages. We will use npm to install all the required packages in our blog. 1$ npm update &amp;&amp; npm upgrade &amp;&amp; npm cache clean Now, we can actually install the hexo package. 1$ npm install hexo-cli -g Creaing Your First BlogNow, in order to create a blog, goto a directory in which you want to create a blog. 1$ hexo init blog After the blog directory is created cd to the created folder and download all the node modules we need to run and manage our blog. 12$ cd blog$ npm install Running Your Blog serverThe following is how to start a node.js server on port 4000. view locally 1$ hexo server Creating Post, Page or Draft1234$ hexo new \"My Post\"$ hexo new post \"My Post\"$ hexo new page \"About Me\"$ hexo new draft \"My Post\" Installing Additional PluginsNow let’s go through a few essential plugins that might leverage your blog’s usability very briefly. Blog SearchUsing this plugin, you can empower your blog with the ability of searching through your post. 1$ npm install hexo-generator-json-content --save Right after installation, the plugin might work out of the box; however, in order to through details of configuration you might want to check the github or your theme’s _config.yaml file. RSS FeedYou can enable your blog with an RSS feed out of your posts in hexo by installing this plugin. 1$ npm install hexo-generator-feed --save The plugin can be configured in the _config.yaml with the following configuration section. 1234feed: type: atom path: atom.xml limit: 20 Markdown SupportThis plugin provides more support on the markdown such as gmf (Github flavored markdown) tables and line breaks. 1$ npm install hexo-renderer-marked --save You can customize the plugin by pasting the following in your _config.yaml and changing the values. 12345678marked: gfm: true pedantic: false sanitize: false tables: true breaks: true smartLists: true smartypants: true Category GeneratorThis plugin allows you to assign one or more tags to your post. It will group your posts and enables your readers to later on find out about all of posts that are tagged with the same category. 1$ npm install hexo-generator-category --save and the related options are as follows: 12category_generator: per_page: 10 CNAME GeneratorThis plugin will automatically generate a Github pages CNAME file. 1$ npm install hexo-generator-cname --save This plugin does not require any specific configuration. Only make sure to change your blog’s url to the real one in the _config.yaml 123# URL## If your site is put in a subdirectory, set url as 'http://yoursite.com/child' and root as '/child/'url: &lt;real-blog-url&gt; Git DeployerThis plugin will help you deploy your blog using git. 1$ npm install hexo-deployer-git --save You can configure the deployer plugin like this: 1234deploy: type: git repo: https://github.com/&lt;username&gt;/&lt;repository&gt; branch: master Deploy to GithubWhen you are ready to deploy your blog to the github, run the following commands to generate your blog and deploy it to the specified branch in your github repository as you setup before. 12$ hexo generate$ hexo deploy Now that you have your generated blog on github, you can configure and connect your custom domain to load your blog from github.","categories":[],"tags":[{"name":"Blogging","slug":"Blogging","permalink":"http://truelogician.com/tags/Blogging/"},{"name":"Hexo","slug":"Hexo","permalink":"http://truelogician.com/tags/Hexo/"},{"name":"StaticWebsite","slug":"StaticWebsite","permalink":"http://truelogician.com/tags/StaticWebsite/"}],"keywords":[]}]}